In [11]:
import sqlite3

In [12]:
#Connect to a database
connection = sqlite3.connect('mydatabase.db')
print("Opened database successfully")

Opened database successfully

In [13]:
cursor = connection.cursor()

In [ ]:
#Create a table
cursor.execute('''
CREATE TABLE if not exists employees
(id Integer PRIMARY KEY, 
 name TEXT not null, 
 age Integer,
 department TEXT
 )''')

print("Table created successfully")

connection.commit()

Table created successfully

In [15]:
cursor.execute('''Select * from employees''')

In [ ]:
#Insert some sample data

cursor.execute("INSERT INTO employees (id, name, age, department) VALUES (1, 'Raj', 20, 'IT')")
cursor.execute("INSERT INTO employees (id, name, age, department) VALUES (2, 'Surya', 21, 'IT')")
cursor.execute("INSERT INTO employees (id, name, age, department) VALUES (3, 'kRISHNA', 22, 'IT')")
cursor.execute("INSERT INTO employees (id, name, age, department) VALUES (4, 'KUMAR', 23, 'IT')")

connection.commit()

In [23]:
#Query the data

cursor.execute("SELECT * FROM employees")
rows = cursor.fetchall()

for row in rows:
    print(row)

(1, 'Raj', 25, 'IT')
(2, 'Surya', 21, 'IT')
(3, 'kRISHNA', 22, 'IT')
(4, 'KUMAR', 23, 'IT')

In [24]:
#update data in table
cursor.execute("UPDATE employees SET age = 25 WHERE name = 'Raj'")
connection.commit()

In [25]:
#delete data from table
cursor.execute("DELETE FROM employees WHERE name = 'KUMAR'")
connection.commit()

In [26]:
#Working with sales database
connection = sqlite3.connect('sales_data.db')

cursor = connection.cursor()

#Create table for sales data

cursor.execute('''
CREATE TABLE if not exists sales
(id Integer PRIMARY KEY, 
 product TEXT not null, 
 sales Integer,
 date TEXT not null,
 region TEXT
 )''')

print("Table created successfully")

connection.commit()

Table created successfully

In [27]:
#INSERT SAMPLE DATA

cursor.execute("INSERT INTO sales (id, product, sales, date, region) VALUES (1, 'Product A', 100, '2022-01-01', 'Region A')")
cursor.execute("INSERT INTO sales (id, product, sales, date, region) VALUES (2, 'Product B', 200, '2022-01-02', 'Region B')")
cursor.execute("INSERT INTO sales (id, product, sales, date, region) VALUES (3, 'Product C', 300, '2022-01-03', 'Region C')")
cursor.execute("INSERT INTO sales (id, product, sales, date, region) VALUES (4, 'Product D', 400, '2022-01-04', 'Region D')")

connection.commit()

In [28]:
cursor.executemany("INSERT INTO sales (id, product, sales, date, region) VALUES (?, ?, ?, ?, ?)", [
    (5, 'Product E', 500, '2022-01-05', 'Region E'),
    (6, 'Product F', 600, '2022-01-06', 'Region F'),
    (7, 'Product G', 700, '2022-01-07', 'Region G'),
    (8, 'Product H', 800, '2022-01-08', 'Region H'),
    (9, 'Product I', 900, '2022-01-09', 'Region I'),
    (10, 'Product J', 1000, '2022-01-10', 'Region J')
])

connection.commit()

In [29]:
#Query the data
cursor.execute("SELECT * FROM sales")
rows = cursor.fetchall()

for row in rows:
    print(row)

(1, 'Product A', 100, '2022-01-01', 'Region A')
(2, 'Product B', 200, '2022-01-02', 'Region B')
(3, 'Product C', 300, '2022-01-03', 'Region C')
(4, 'Product D', 400, '2022-01-04', 'Region D')
(5, 'Product E', 500, '2022-01-05', 'Region E')
(6, 'Product F', 600, '2022-01-06', 'Region F')
(7, 'Product G', 700, '2022-01-07', 'Region G')
(8, 'Product H', 800, '2022-01-08', 'Region H')
(9, 'Product I', 900, '2022-01-09', 'Region I')
(10, 'Product J', 1000, '2022-01-10', 'Region J')

In [30]:
connection.close()